HELP_COMMAND_MESSAGE = """
Бот анализирует русскоязычные новости, и может присылать вам оповещения и появлении в них выбранных вами тем.
Для работы бота добавьте его в вашу группу с возможностью писать сообщения.
Для настройки категорий после добавления в группу введите (в группе) команду /categ
"""

CATEGORIES_MESSAGE = """
Выберите нужные вам категории новостей.
Бот будет присылать оповщения только о тех темах которые вы отметили.
"""

ADD_MESSAGE = """
По умолчанию будут прислыаться оповещения обо всех темах.
Для настройки категорий воспользуйтесь командой /categ
"""
