HELP_COMMAND_MESSAGE = """
Бот анализирует русскоязычные новости, и может присылать вам оповещения и появлении в них выбранных вами тем. Для работы бота добавьте его в группу с возможностью писать сообщения.
"""

CATEGORIES_MESSAGE = """
Выберите нужные вам категории новостей
Бот будет присылать оповщения только о тех темах
у которых в статусе есть *
<code>
{incidents}
</code>
"""

ADD_MESSAGE = """
По умолчанию будут прислыаться оповещения обо всех темах.
Для настройки категорий воспользуйтесь командой /categ
"""
