HELP_COMMAND_MESSAGE = """
Бот анализирует русскоязычные новости, и может присылать вам оповещения и появлении в них выбранных вами тем.
Для работы бота добавьте его в вашу группу с возможностью писать сообщения.
Для настройки категорий после добавления в группу введите (в группе) команду /categ
Команды, которые можно использовать в гурппе:
/categ - настройка категорий
/country - фильтрация инцидентов по странам
/region - для РФ также можно выбрать регион
"""

CATEGORIES_MESSAGE = """
Выберите нужные вам категории новостей.
Бот будет присылать оповщения только о тех темах которые вы отметили.
"""

COUNTRY_MESSAGE = """
Выберите нужные вам страны
Бот будет присылать оповщения только от источников из выбраных стран
"""

REGION_MESSAGE = """
Выберите нужные вам регионы
Бот будет присылать оповщения только от источников из выбраных регионов
На данный момент разибвка на регионы, есть только для России
"""

ADD_MESSAGE = """
По умолчанию будут прислыаться оповещения обо всех темах.
Настройки:
Категории - /categ
Страны - /country
Регионы - /region
"""
