COUNTRIES = {
    "ARM": ("армянский", "армения"),
    "AZE": ("азербайджанский", "азербайджан"),
    "BLR": ("белорусский", "беларусь"),
    "EST": ("эстонский", "эстония"),
    "GEO": ("грузинский", "грузия"),
    "KAZ": ("казахстанский", "казахстан"),
    "KGZ": ("киргизский", "киргизия"),
    "LVA": ("латвийский", "латвия"),
    "LTU": ("литовский", "литва"),
    "MDA": ("молдавский", "молдова"),
    "RUS": ("российский", "россия"),
    "TJK": ("таджикский", "таджикистан"),
    "TKM": ("туркменский", "туркменистан"),
    "UKR": ("украинский", "украина"),
    "UZB": ("узбекистанский", "узбекистан"),
    "DEU": ("немецкий", "германия"),
}

TOPONYMS = {
    "RU-AMU": ("амурский", "благовещенск"),
    "RU-ARK": (
        "архангельский",
        "архангельск",
    ),
    "RU-AST": (
        "астраханский",
        "астрахань",
    ),
    "RU-BEL": (
        "белгородский",
        "белгород",
    ),
    "RU-BRY": (
        "брянский",
        "брянск",
    ),
    "RU-VLA": (
        "владимирский",
        "владимир",
    ),
    "RU-VGG": (
        "волгоградский",
        "волгоград",
    ),
    "RU-VLG": (
        "вологодский",
        "вологда",
    ),
    "RU-VOR": (
        "воронежский",
        "воронеж",
    ),
    "RU-IVA": (
        "ивановский",
        "иваново",
    ),
    "RU-IRK": (
        "иркутский",
        "иркутск",
    ),
    "RU-KGD": (
        "калининградский",
        "калининград",
    ),
    "RU-KLU": (
        "калужский",
        "калуга",
    ),
    "RU-KEM": (
        "кемеровский",
        "кемерово",
    ),
    "RU-KIR": (
        "кировский",
        "киров",
    ),
    "RU-KOS": (
        "костромской",
        "кострома",
    ),
    "RU-KGN": (
        "курганский",
        "курган",
    ),
    "RU-KRS": (
        "курский",
        "курск",
    ),
    "RU-LEN": ("ленинградский",),
    "RU-LIP": (
        "липецкий",
        "липецк",
    ),
    "RU-MAG": (
        "магаданский",
        "магадан",
    ),
    "RU-MOS": ("московский",),
    "RU-MUR": (
        "мурманский",
        "мурманск",
    ),
    "RU-NIZ": ("нижегородский",),
    "RU-NGR": (
        "новгородский",
        "новгород",
    ),
    "RU-NVS": (
        "новосибирский",
        "новосибирск",
        "бердск",
        "бердский",
    ),
    "RU-OMS": (
        "омский",
        "омск",
    ),
    "RU-ORE": (
        "оренбургский",
        "оренбург",
    ),
    "RU-ORL": (
        "орловский",
        "орел",
    ),
    "RU-PNZ": (
        "пензенский",
        "пенза",
    ),
    "RU-PSK": (
        "псковский",
        "псков",
    ),
    "RU-ROS": (
        "ростовский",
        "ростов",
    ),
    "RU-RYA": (
        "рязанский",
        "рязань",
    ),
    "RU-SAM": (
        "самарский",
        "самара",
    ),
    "RU-SAR": (
        "саратовский",
        "саратов",
    ),
    "RU-SAK": (
        "сахалинский",
        "сахалин",
        "южно-сахалинск",
        "южно-сахалинский",
    ),
    "RU-SVE": ("свердловский", "екатеринбург", "екатеринбургский"),
    "RU-SMO": (
        "смоленский",
        "смоленск",
    ),
    "RU-TAM": (
        "тамбовский",
        "тамбов",
    ),
    "RU-TVE": (
        "тверской",
        "тверь",
    ),
    "RU-TOM": (
        "томский",
        "томск",
    ),
    "RU-TUL": (
        "тульский",
        "тула",
    ),
    "RU-TYU": (
        "тюменский",
        "тюмень",
    ),
    "RU-ULY": (
        "ульяновский",
        "ульяновск",
    ),
    "RU-CHE": (
        "челябинский",
        "челябинск",
    ),
    "RU-YAR": (
        "ярославский",
        "ярославль",
    ),
    "RU-AD": (
        "адыгея",
        "адыгейский",
        "майкоп",
        "майкопский",
    ),
    "RU-BA": (
        "башкортостан",
        "башкирский",
        "уфа",
        "уфимский",
    ),
    "RU-BU": (
        "бурятия",
        "бурятский",
        "улан-удэ",
    ),
    "RU-DA": (
        "дагестан",
        "дагестанский",
        "махачкала",
        "махачкалинский",
    ),
    "RU-IN": (
        "ингушетия",
        "ингушский",
        "магас",
        "магасский",
    ),
    "RU-KB": (
        "кабардино-балкария",
        "кабардино-балкарский",
    ),
    "RU-KL": (
        "калмыкия",
        "калмыцкий",
        "элиста",
    ),
    "RU-KC": (
        "карачаево-черкесия",
        "карачаево-черкесский",
        "черкесск",
    ),
    "RU-KR": (
        "карелия",
        "петрозаводск",
        "петрозаводский",
    ),
    "RU-ME": (
        "марий",
        "марийский",
        "йошкар-ола",
        "йошкар-олинский",
    ),
    "RU-MO": (
        "мордовия",
        "мордовский",
        "саранск",
        "саранский",
    ),
    "RU-AL": ("горно-алтайск", "горноалтайский", "алтай"),
    "RU-KO": (
        "коми",
        "сыктывкар",
        "сыктывкарский",
    ),
    "RU-SA": (
        "якутия",
        "якутск",
        "якутский",
    ),
    "RU-SE": (
        "осетия",
        "осетинский",
        "владикавказ",
        "владикавказский",
    ),
    "RU-TA": (
        "татарстан",
        "татарский",
        "казань",
        "казанский",
    ),
    "RU-TY": (
        "тыва",
        "тувинский",
        "кызыл",
        "кызылский",
    ),
    "RU-UD": (
        "удмуртия",
        "удмуртский",
        "ижевск",
        "ижевский",
    ),
    "RU-KK": (
        "хакасия",
        "хакасский",
        "абакан",
        "абаканский",
    ),
    "RU-CE": (
        "чечня",
        "чеченский",
        "грозненский",
    ),
    "RU-CU": (
        "чувашия",
        "чувашский",
        "чебоксары",
        "чебоксарский",
    ),
    "RU-ALT": (
        "алтайский",
        "барнаул",
        "барнаульский",
    ),
    "RU-ZAB": (
        "забайкальский",
        "чита",
        "читинский",
    ),
    "RU-KAM": (
        "камчатский",
        "петропавловск-камчатский",
    ),
    "RU-KDA": (
        "краснодарский",
        "краснодар",
    ),
    "RU-KYA": (
        "красноярский",
        "красноярск",
    ),
    "RU-PER": (
        "пермский",
        "пермь",
    ),
    "RU-PRI": ("приморский", "приморье", "владивосток", "владивостокский"),
    "RU-STA": ("ставропольский", "ставрополь", "ставрополье"),
    "RU-KHA": (
        "хабаровский",
        "хабаровск",
    ),
    "RU-NEN": (
        "ненецкий",
        "нарьян-мар",
        "нарьян-марский",
        "нао",
    ),
    "RU-YAN": (
        "ямало-ненецкий",
        "салехард",
        "салехардский",
        "янао",
    ),
    "RU-KHM": (
        "ханты-мансийский",
        "югра",
        "ханты-мансийск",
        "сургут",
        "сургутский",
        "хмао",
    ),
    "RU-CHU": (
        "чукотский",
        "чукотка",
        "анадырь",
        "анадырьский",
    ),
    "RU-SPE": (
        "санкт-петербург",
        "санкт-петербургский",
        "петербург",
        "петербургский",
    ),
    "RU-MOW": ("москва",),
    "RU-YEV": (
        "еврейский",
        "биробиджан",
        "биробиджанский",
    ),
    "UA-43": (
        "крым",
        "крымский",
        "симферополь",
        "симферопольский",
    ),
    "UA-40": (
        "севастополь",
        "севастопольский",
    ),
}
